In [1]:
# exanple 1
import pandas as pd
df=pd.read_csv('sheet3.csv')
df.head()

  Time (Day)  Time (hr)  Temperature (C)
0      Day 2     30.271             26.1
1      Day 2     27.179             26.2
2      Day 7    146.190             26.3
3      Day 2     27.487             26.4
4      Day 4     85.254             26.6

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 485 entries, 0 to 484
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Time (Day)       484 non-null    object
 1   Time (hr)        484 non-null    float64
 2   Temperature (C)  485 non-null    float64
dtypes: float64(2), object(1)
memory usage: 11.5+ KB

In [3]:
# exanple 2
A = df[['Time (hr)', 'Temperature (C)']]
A

     Time (hr)  Temperature (C)
0       30.271             26.1
1       27.179             26.2
2      146.190             26.3
3       27.487             26.4
4       85.254             26.6
..         ...              ...
480      0.310             26.1
481      0.310             26.1
482      0.000             26.0
483      0.000             26.0
484        NaN             26.8

[485 rows x 2 columns]

In [4]:
#  exanple 3
df.sort_values('Time (hr)', ascending=True, inplace=True)
df

    Time (Day)  Time (hr)  Temperature (C)
483      Day 1      0.000             26.0
482      Day 1      0.000             26.0
481      Day 1      0.310             26.1
480      Day 1      0.310             26.1
376      Day 1     10.193             26.2
..         ...        ...              ...
320      Day 7    166.889             26.4
303      Day 7    167.198             26.0
322      Day 7    167.508             26.5
347      Day 7    167.817             26.6
484        NaN        NaN             26.8

[485 rows x 3 columns]

In [5]:
# exanple 4
grouped_df = df.groupby(['Time (hr)', 'Temperature (C)'])['Time (Day)'].sum()
grouped_df

Time (hr)  Temperature (C)
0.000      26.0               Day 1Day 1
0.310      26.1               Day 1Day 1
10.193     26.2                    Day 1
10.501     26.0                    Day 1
10.810     26.3                    Day 1
                                 ...
166.579    26.7                    Day 7
166.889    26.4                    Day 7
167.198    26.0                    Day 7
167.508    26.5                    Day 7
167.817    26.6                    Day 7
Name: Time (Day), Length: 482, dtype: object

In [6]:
# exanple 5
x=df.iloc[0,2]
x

26.0

In [7]:
#  exanple 6
y=df.iloc[0:7,0:3]
y

    Time (Day)  Time (hr)  Temperature (C)
483      Day 1      0.000             26.0
482      Day 1      0.000             26.0
481      Day 1      0.310             26.1
480      Day 1      0.310             26.1
376      Day 1     10.193             26.2
289      Day 1     10.501             26.0
194      Day 1     10.810             26.3

In [8]:
#  exanple 7
y=df.loc[4,'Temperature (C)']
y

26.6

In [9]:
# problem 8
# في 5 استعملنا loc عشان كان طالب كله index مفيش صف متسمي
#و ف 7 استعملنا iloc عشان كان طالب مننا اسم raw

In [4]:
# problem 9
k=df['Temperature (C)']
for i in range (len(k)):
    if k[i] <= 26 and k[i] >= 26.6:
        print(i,k[i])

NameError: name 'df' is not defined

In [5]:
# problem 10
k=df['Temperature (C)']
day=df['Time (Day)']
for i in range (len(k)):
    if k[i] == 26.6:
        print(i,k[i],day[i])

NameError: name 'df' is not defined

In [12]:
# problem 11
import numpy as np
k=df['Temperature (C)']
num=[]
for i in range (len(k)):
    if k[i] >= 26 and k[i] <= 26.6:
        num.append(k[i])
avg_temp=np.mean(num)
avg_temp

26.32897603485839

In [13]:
# problem 12
df = df[df['Temperature (C)'] <= 26.328976]
df

    Time (Day)  Time (hr)  Temperature (C)
483      Day 1      0.000             26.0
482      Day 1      0.000             26.0
481      Day 1      0.310             26.1
480      Day 1      0.310             26.1
376      Day 1     10.193             26.2
..         ...        ...              ...
426      Day 7    161.943             26.3
365      Day 7    162.253             26.2
446      Day 7    165.034             26.3
463      Day 7    165.341             26.2
303      Day 7    167.198             26.0

[202 rows x 3 columns]